In [1]:
import pandas as pd

In [157]:
a=pd.Series([1,2,3,4,5],['a','b','c','e','f'])
a

a    1
b    2
c    3
e    4
f    5
dtype: int64

In [41]:
n=list(a)
n=list(a.index)
a1=pd.Series([1,2,3,4])
a2=pd.Series([2,10,4,5])
print(a1+a2)
print(a1-a2)
print(a1*a2)
print(a1/a2)

0     3
1    12
2     7
3     9
dtype: int64
0   -1
1   -8
2   -1
3   -1
dtype: int64
0     2
1    20
2    12
3    20
dtype: int64
0    0.50
1    0.20
2    0.75
3    0.80
dtype: float64

In [55]:
a=pd.Series(['a','b','C'])

a=pd.Series([i.upper() for i in a])
   
print(a)

a=pd.Series([i.lower() for i in a])

print(a)

0    A
1    B
2    C
dtype: object
0    a
1    b
2    c
dtype: object

In [59]:
a=pd.Series([' a ','a b','b ',' d'])
print(a)

a=pd.Series([(i.strip()).replace(" ",'') for i in a])

a

0     a
1    a b
2     b
3      d
dtype: object

0     a
1    ab
2     b
3     d
dtype: object

In [133]:
from random import random
df=pd.DataFrame({'Student':['ud','pa','ko'],'Father':['f1','f2','f3'],'Phone':[1,2,3]},[1,2,3])

df

  Student Father  Phone
1      ud     f1      1
2      pa     f2      2
3      ko     f3      3

In [125]:
df.columns

Index(['Student', 'Father', 'Phone'], dtype='object')

In [150]:
df['Student'][2]="lkash"

C:\Users\y20cs177\AppData\Local\Temp/ipykernel_9944/3776993376.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Student'][2]="lkash"

  Student Father  Phone
1      ud     f1      1
2   lkash     f2      2
3      ko     f3      3

In [156]:
df['new_col']=None

df

  Student Father  Phone new_col
1      ud     f1      1    None
2   lkash     f2      2    None
3      ko     f3      3    None

##########################################################end of chapter-1#####################################################

In [159]:
l=[['n1',1],['n2',2],['n3',3]]

df=pd.DataFrame(l,columns=['name','num'])
df

  name  num
0   n1    1
1   n2    2
2   n3    3

In [160]:
df=pd.DataFrame({'name':['n1','n2','n3'],'num':[1,2,3]})
df

  name  num
0   n1    1
1   n2    2
2   n3    3

In [162]:
df=pd.DataFrame({'name':['n1','n2','n3'],'num':[1,2,3]},index=[100,200,300])
df

    name  num
100   n1    1
200   n2    2
300   n3    3

In [164]:
l=[{'name':'n1','num':123},{'name':'n2','num':234}]

df=pd.DataFrame(l)

df

  name  num
0   n1  123
1   n2  234

In [169]:
l=[{'name':'n1','num':123},{'name':'n2','num':234}]

df=pd.DataFrame(l,index=[1,2])

df

  name  num
1   n1  123
2   n2  234

In [172]:
l=[('n1',123),('n2',234)]

df=pd.DataFrame(l,index=[1,2],columns=['name','num'])

df

  name  num
1   n1  123
2   n2  234

In [189]:
df.sort_values(by='name',ascending=False,inplace=True)

df

  name  num
2   n2  234
1   n1  123

In [191]:
df.max()

name     n2
num     234
dtype: object